[
    {
        "id": 1,
        "name": "Amy C. from Woodbridge, VA",
        "text": "We hired Va Deck builders to take down our old deck and rebuild. They were able to use the existing posts which was great. I got exactly the look I wanted  and by keeping the same posts and footprint we didn't have to get a new deck permit. Va deck builders were very good."
    },
    {
        "id": 2,
        "name": "Nathan T. from Alexandria, VA",
        "text": "I highly recommend for any deck work. They replaced boards, added a section for our grill and built a step down to our lawn. Whenever we had questions or felt something might be off, they went through things with us until we were happy. After all the work was done, they came back a few weeks later to replace an entire board that had a few bubbles under the paint. Everything looks so much better now and it was quality work."
    },
    {
        "id": 3,
        "name": "Caroline A. from Oakton, VA",
        "text": "Nikolay and his crew have been fantastic. They replaced our deck that was almost thirty years old and brought it up to code. It looks amazing. I would highly recommend these guys."
    },
    {
        "id": 4,
        "name": "Alison G. from Annandale, VA",
        "text": "Nikolay has been a pleasure to work with on multiple occasions. Highly recommend his work. Great craftsmanship and quality."
    },
    {
        "id": 5,
        "name": "Joey L. from Falls Church, VA",
        "text": "Nikolay did a great job. He showed up, did his measurements and was able to put me on his schedule. His team was professional to make sure things were covered so no paint would get on the vinyl siding. They worked hard over the intense summer heat to get the job done on time. My deck is now protected from the seasonal Virginia weather and looks great too."
    },
    {
        "id": 6,
        "name": "Sam L. from Falls Church, VA",
        "text": "Top-notch work for an unbeatable price. Nikolay was very responsive for all our questions. He and his team worked through some really freezing temperatures (courtesy of the 2019 polar vortex) and we're very grateful they got the job done. We are thrilled with the completed front porch and would definitely recommend!"
    },
    {
        "id": 7,
        "name": "Rachel M. from Springfield, VA",
        "text": "We started our search for a deck company to renovate our deck.  The floorboards on our original deck were not in good condition, but the railings were.  The previous owners used horrible paint to cover up the floorboards, but it chipped after a month of moving in. After receiving quotes from 4 different companies, we finally decided on Birginia Deck builders.  The owner, Nikolay, was the person who came to the house the quote.  We weren't exactly sure the path we wanted to take, but he supplied me with 4-5 different quotes to show me the different prices points.  His estimates were clear and detailed with the cost for each part of the work. I communicated with him through text and email.  His responsiveness was beyond exceptional.  Usually responding within minutes, but never more than a few hours. We are very happy with the final product. Nikolay worked with us through the whole process, answering any and all questions.  I would HIGHLY recommend Virginia Deck Builders to anyone.  We can finally enjoy our deck!"
    },
    {
        "id": 8,
        "name": "Shripal S. from Washington, DC",
        "text": "Hired these guys to stain our deck, balcony and fence and was very happy with their work. The project was done in a timely fashion and they were very careful and thorough from start to finish. They're also very responsive which I appreciated, any time I had a question they were quick to text me back. Highly recommend."
    },
    {
        "id": 9,
        "name": "Dan F. from Washington, DC",
        "text": "Nickolay did a fantastic job at a completely reasonable price. Unlike other companies that tried to talk me into ripping out my wood deck and putting in synthetic materials, Nickolay did the right job, with good materials, and my deck looks great. I've already recommended him to a friend and I'm sure I will again."
    },
    {
        "id": 10,
        "name": "gilbert p. from Washington, DC",
        "text": "Dealing with Virginia Deck Builders was a pleasure. They finished the work on time, on budget, and now my deck looks beautiful. Thanks again! Great work!"
    },
    {
        "id": 11,
        "name": "Jamie H. from Washington, DC",
        "text": "Nikolay and his team just completed our gorgeous trex deck and we are very pleased both with the craftsmanship and their overall professionalism. He worked with a certified engineer to draw up our plans which resulted in a very well designed deck. The permitting process wasn't super straightforward but Nikolay personally resolved the issues and was persistent as I asked. His team works incredibly hard to make sure your project is done quickly and correctly. We would highly recommend them to anyone thinking of building a deck!"
    },
    {
        "id": 12,
        "name": "Christi G. from Redondo Beach, CA",
        "text": "I am beyond impressed with the work that Nikolay and his team did for my rooftop deck.  I would use this company again for any of my deck needs.  They were extremely professional and went the extra mile, making sure that I was happy with the output.  Nikolay gave me a fair price for the work and I am so glad that I went with him for the job!  You will not be disappointed with this company!"
    },
    {
        "id": 13,
        "name": "Jason K. from Alexandria, VA",
        "text": "We had to get our deck taken care since it had been awhile since we got re-stained.  The deck was splintering, there were loose nails, and some bad boards.  We contacted Nickolay and they quickly came out and did an estimate.  His estimate was a very good price and then we scheduled time for his team to come. They were exceptionally thorough, explained to me the issues and the work they did and accomodate my schedule to ensure that I was happy.  I highly recommend them and I'm very happy with their work.  They went the extra mile to ensure things were complete and I was happy!"
    },
    {
        "id": 14,
        "name": "Jenny Alvarado from Richmond, VA",
        "text": "We are so very pleased with our new deck! From start to finish, Virginia Deck Builders was a pleasure to work with. The planning consultations were very thorough. The construction crew was very careful and courteous. The finished deck looks amazing. I am just blown away by the work quality and character of the entire team at Virginia Deck Builders!!"
    },
    {
        "id": 15,
        "name": "Victoria Henry Hitchcock from Washington, DC",
        "text": "I absolutely love my new deck. The quality of the workmanship and materials used is impeccable. I highly recommend this company to anyone considering a new deck or replacing an old deck. The installers were professional, cleaned up the site, and insured we were pleased with how everything was going through each step of the project."
    },
    {
        "id": 16,
        "name": "Terri Mercer from Washington, DC",
        "text": "Excellent, on time, within budget, and great quality. They showed great care and creativeness. Very skillful very clean team of workers. Would be happy to recommend Virginia Deck Builders."
    }
 

]